#pragma once

// Name: BlazingSails, Version: 1.481.81

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Character_AnimBP.Character_AnimBP_C
// 0xBB28 (0xBE88 - 0x0360)
class UCharacter_AnimBP_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AD9D9D8A43C5795C46159D8CBC255D96;// 0x0368(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F22DBF8948C812E52BC2E7B9AA7E7459;// 0x03B0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9D0E611F4A746845ECA8C59556C9AEAE;// 0x03F8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_84547E3A49887BF52570869F0B54719C;// 0x0440(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F16A02124984E51E6CE225ACCD2EF3C4;// 0x0488(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CE19922E499E74FD1F3A619207ACA131;// 0x0528(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_37AEFA9F4D200D9B3704C4B58BC320BA;// 0x0568(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_01DCAD6C43E9B89D3BEAA49667C19409;// 0x0608(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FABC2D2F4B1510CEA2261881AAE6C133;// 0x06A8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9911A32941DE25BED350A48541D46C69;// 0x0748(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_33F0845C4B3074E15258EDB28710DD8C;// 0x07E8(0x00A0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_A68CC0984EACBACDA8FB0295A18F5377;// 0x0888(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F78F9BBA471591BB91C146B95961D039;// 0x0968(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_035EDAAB4213C04F04F6A08539147B88;// 0x0A38(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7584A01641CA713E328209A814F74131;// 0x0AD8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7D5BDD8A400E9D1CDDCE79A4082399AB;// 0x0B78(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_62E5AC634D7202EB4B4183A15E873001;// 0x0C48(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_0E2734044A0C8C002EBD8DBC57604A29;// 0x0CE8(0x00D8)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_E50E6B65476FA671E2EA58AAD047233B;// 0x0DC0(0x0070)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_EFDE99294D57F64FEEA8E894CCE4F85D;// 0x0E30(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CBE2FBDA4EDF2B5CE9C3D2ADBEB4D495;// 0x0E70(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_87ADA5ED409E7EA0690C75BAC289527E;// 0x0F40(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_927E20B84362447CEA4E68A2C8584219;// 0x0FE0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A463CC3740FE6CF3AE501BB4F0BEEC6C;// 0x10B0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4D4691ED4C21C93F6F1318851D7C326A;// 0x1150(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D202D551412A97668988A6931C817A92;// 0x1220(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_17E96990446D3048B42DA8B8DC073001;// 0x12C0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_693749F14B323482B3FEBA8BEBFFC51E;// 0x1390(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B6BB48CA4028B59562031E954DA20F3B;// 0x1430(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D23FEFED4337B2227271EEA76FEE7BD7;// 0x1500(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3B96F5CC4BF24DF37B29B294631FF87F;// 0x15A0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_60094DC046752D4C79C650B475F54245;// 0x1670(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1DE9B5B74DD76430C07700A069F43C1D;// 0x1710(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_922B771847535DE15A29C097169586A2;// 0x17E0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2F1908CF4444A60CE1E48883A0C3BC14;// 0x18B0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A88A00204375A18BF1B612A02D86FAE8;// 0x1950(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E603D123466348438CE14F9B9210B772;// 0x19F0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E472686443EA8A45C5ACBAACC405E2BD;// 0x1AC0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D790F19D4AF3B5FAD32549B1BF7EA23A;// 0x1B60(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_26DF7FEE4265B80FC274FEAF74D07CCD;// 0x1C30(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C7745A1548C4DF545C8A87A24FB1BE25;// 0x1D58(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7D011B8A4482C8BC491D0D85DEFCB302;// 0x1DF8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EBE886CC40E0B610918DCC8BE3A195ED;// 0x1E98(0x00A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C8E0AABF492AD26947431CAD9E9B91BF;// 0x1F38(0x0138)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E20AE2B34463209026A0449C512E112E;// 0x2070(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_4655183648DBB0725D4DF49EB38DF125;// 0x2198(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_6DF6F12D4CBDDC046CB13DA3257797D3;// 0x2270(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7DA646FD4E9957F8A0178D9074E74EFD;// 0x2398(0x00D0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_D04A9E22484CAFC197131E9072736B35;// 0x2468(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_0044D2804478C41F80367182FBA57ADE;// 0x2540(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_95B8CE414B48ED0CAC795D833D95602E;// 0x2580(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B062461B4C51399A6DE1AEA4480BF5FD;// 0x25C0(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_67BD6BC14271502B6D723DBB14AE3F97;// 0x2660(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9C0129AD47E99FFD7D62A5AA83D0187F;// 0x2788(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F167270C4C04195BB2A6A8B8564292C7;// 0x2828(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_24AACAD94566ADADE7DB618C659A9D13;// 0x28C8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4429DA1F469C74A590CCC0971C522CCE;// 0x29F0(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F38BF7184BA0810AB16D3E851CADA6DF;// 0x2B18(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B94143EF4C4BCB7A26C97D80E41DEBE3;// 0x2BB8(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5807D35E4035F58C44DC6690587FBE05;// 0x2C88(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_545E364B4182FE044343249DCD0F97DB;// 0x2DB0(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_996302AC44A526DF8EE5B3A2C4779496;// 0x2E88(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6643F1DE4B702A6E8675E5862F2C16BF;// 0x2FB0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D35B966440F2386317331BA2624F654C;// 0x3050(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B13E8E2B4792337601BA82824BA3F2E9;// 0x3120(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7B5DF17641CE5A18551C46B52758E25E;// 0x31C0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2F28329A464885A104EF3A81420EE246;// 0x3290(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A1902AD54F85BE9AF13AD6BADA5B3693;// 0x3330(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8D78E2F8484FB0F76B05B4B0CDFF1A8B;// 0x3400(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CB468B64436484A9440C0EBEC151D71E;// 0x34A0(0x00D0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E7E2461E4434CEC30D3694B619D2EC0F;// 0x3570(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DABAA2504809372CFA5DCBB9C6A987CA;// 0x36A8(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_00A70DC44891CD65EB98E38855E49577;// 0x37E0(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CD58802645651724C3F3C7AB1749FC01;// 0x3918(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3FAC085E462C40EC7A9614A196D83FCE;// 0x3A50(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D80CF66C492232827FA3DF8E993CF087;// 0x3B88(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_82244DAD410142996B02518D1AD027AD;// 0x3CC0(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3CC7302C4CD11F478F42ADA475EEE495;// 0x3DF8(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2AE72E714B80D6A01F820B9A12EF525C;// 0x3F30(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3C4DAB7B4E9738CD52FF3A963FA5D900;// 0x4068(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C535ACE049571A14329C45906E37DE97;// 0x41A0(0x0138)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AAD2140E45EF56E95EED878ACA50A6EE;// 0x42D8(0x0128)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_39A8AAF2487EB01D495EA6A4B8138E2D;// 0x4400(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_B9E9B29944B54B39FAA423BC15004769;// 0x4440(0x0040)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_9BAE5E8A424CF7F664AA3793EBCF885F;// 0x4480(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A5446A5E4F4E4F9075D2DFA708908E40;// 0x4558(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_32910DEA4868FF462AB38FAF61D9DC55;// 0x4680(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3D1BD5D04B40B429D99A19B3C9F16CC8;// 0x4720(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A3D2CBAE4446EA39202B9D83E5BDE1B1;// 0x47F0(0x00D0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_7484ECED45BE98E6DCD92EACDBC54A7E;// 0x48C0(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_71873944487D9648CFC00F993F1A16B3;// 0x4998(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D2E82E79422CA97CE71639AC74FB0A78;// 0x4AC0(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A6D756E84352E62D3F1AEC8949DDA0B8;// 0x4B60(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2883489E4DF9A3039E308CB011BCF567;// 0x4C30(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6B9ACA7C4FE102980B92618BD29C3024;// 0x4D58(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_09BA845846B08DC3BE9E64B5461BAE55;// 0x4E30(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1CA56F27473C6E93B30DDC840CD8FF81;// 0x4ED0(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_01B9572C4A0D352936C3E79AC6F2F6D1;// 0x4FF8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10DF9CCB4F334DE00046428229692A0D;// 0x50C8(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_4B0072C54418CB70FAD206A780401DE0;// 0x5168(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_BAAA198D4EAB0D6E432B3C80243CC5A5;// 0x5240(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_7B10A1494632ADDFEE6FED9E8A54BD1E;// 0x5280(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AF67F32546A931246075D1B75D2839A3;// 0x52C0(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C47405B043FC985633B0BAA2301F0CC9;// 0x53E8(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F14F4F534B27D0B39502E8B3DFEF434A;// 0x54C0(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A31308EB42F5C775990ACEA97FE541E0;// 0x55E8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_305A43E24257A5321182EF948325AE3E;// 0x5688(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D83D944B4FA6C741FDD2919393869023;// 0x5758(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_32EDB65048D4B15847AAC095AC3B4F95;// 0x57F8(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_78C86B534DE88D76B91F5F9142498FB1;// 0x58D0(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_912056CA4C778C78F472F49E9FB66276;// 0x5910(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2F774D71423F4AB63827D2A24D329749;// 0x5950(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A28DC2BC4DBAD5C6B1DCE49FF356D7DA;// 0x5A78(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_925F5B6446F5E315ADB1F29DD4807830;// 0x5BA0(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_F9CFCFD348DF0DBAC818B5B22B2A8B16;// 0x5CC8(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A3722EF47AAD39665DCC892050CFD16;// 0x5DA0(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_74F9C2F24AFFEC939E1CF8B516B9A81E;// 0x5E40(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FF739A384EC27746CEAD988046AC96F0;// 0x5F68(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DE0F65A34738CE0BAD696C939089EFB8;// 0x6038(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_FC5B042C45AF86D6C6E5738E31A823FE;// 0x60D8(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_4478FA6C45909E46E067F7B5D39B97F8;// 0x61B0(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D9703BDE4607C244B1E97DA6CF67376B;// 0x61F0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EC103A634655199DCBD7F4B62BAFE72E;// 0x6230(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_697D099C4ED9C63A6F2D2EB9BB4369F1;// 0x6358(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4BE4A8AA4E0E864C6A6F64926088D7B4;// 0x6430(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_273020F8410E589A614635B088443313;// 0x64D0(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4CAD156843F1D9D3B1BA1A8204FC568F;// 0x65F8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C70574484C0FAA617AE114BD6BC95F6E;// 0x66C8(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_50DB5B81405F71FDC955D8B841FED152;// 0x6768(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_F9A4C838451ADB9E1FA0E7B8A15C0CC6;// 0x6840(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_AB34AD5249B538B1607C25A5AE23D63B;// 0x6880(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F67ABBF146CB83E2D031D39BA63E87AB;// 0x68C0(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_A1721B0C4BC700F0F8B0EF8F05E09FCE;// 0x69E8(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AB0A98EF48D8B124B6E1BD9DC5E40FCB;// 0x6AC0(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E08C78A34FB61C27439CD8A038C11D8F;// 0x6BE8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_78ED46FD4FC6AFE1DE65C5A5352F00CB;// 0x6CB8(0x00A0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_007869A24578171574C2C9BB0D7E8C02;// 0x6D58(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_70297C674E83957DEACBB88110D779DC;// 0x6D98(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DED7FC204E73A7FB8742F2A590A34675;// 0x6DD8(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C24135674643AD40D68326BBF3A170D8;// 0x6F00(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_15B41B1D4AD409D2CFF04F89F61B5544;// 0x6FD8(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7EE47BEE46E05BBB1D7F8197069DF3FB;// 0x7078(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_098C305E4064322AFECA9690FA3DFFBD;// 0x71A0(0x00D0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2B9C633745990BB89E4E35AAFB2B7CCA;// 0x7270(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_70821F0C4941AF92387842BD559FA89E;// 0x72B0(0x0040)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_ACF6304B4D804BB146996DB7242F9227;// 0x72F0(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A69EDA514677C62C7EAC84ADF506B114;// 0x73C8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C9CA7AF64AE7C16AA033CCA2D4AEBF18;// 0x74F0(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_96B3768A4FB858262639388AFB7506A1;// 0x7618(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F0F23683460EE8016A8DCE90EC579A58;// 0x76F0(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_F689F2EB4A7A64848FCB56A74AA826F3;// 0x7818(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1382E5EF415D6DCFDFA78E8875ED15AD;// 0x78F0(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BCA2E5334CA5D0283C470CAEBF69B864;// 0x7990(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_42B274DC4D9E15FC6DAF4A9855602F2C;// 0x7AB8(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_38CED14E4298A5AE5A7EC0A8349C7F4B;// 0x7B90(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_97E082B349207CA056B020A897CB7A12;// 0x7C30(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A0B7CCEC4255EE7CFDCE6AA59142D85D;// 0x7D00(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E2761B0E444C6C756073458286DD3C04;// 0x7E28(0x00D0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6A0F404E41D7A099568914A5756847AD;// 0x7EF8(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_8016E5244FAA8B281CE70398F31008F9;// 0x7FD0(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_1D5C95304D249CC2CB85A880C7D23984;// 0x8010(0x0040)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_B61A84404D83786ECCBCA0B1A20A1F6B;// 0x8050(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B84A40F147352EB2159B1C9945CA9A7D;// 0x8130(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F8C4014E4C4751825449F8AE76AC5B22;// 0x8258(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A7A10CF44F9B4306B41AC1893BC79AAA;// 0x8380(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A1034E8646514CE4245DC6A8BC11BF03;// 0x8450(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_8825CACF42C2FF3670A78DA0BA03040B;// 0x84F0(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7C5B54C449E55478D8F9A8966D84D7DF;// 0x85C8(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_CB328F32485F79EA60547F82FD757070;// 0x8608(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F67A312A4BD8904ADC42A2B89F9BFC2D;// 0x8648(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8839AFDE4BC4C7370838B4B2DBE84FBF;// 0x8770(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5DC71AFD4E5103DD14DAACB28A288523;// 0x8898(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_993052574158436B922BBFAD04C74A35;// 0x8968(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1713C1A5414A9753277EFEABC1F89E24;// 0x8A08(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CD76CD864EE35C49DC09C384B4701415;// 0x8AD8(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C3E0B0724B89B6833DC1B48E2DCCBC45;// 0x8B78(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C0AB751C407DDF2994ADA9A02B36C4DB;// 0x8C50(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_0BF3A66A4D2404385ADFCB9C5E6BB81D;// 0x8C90(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_1BE57BC347AD7B7535269F89E2B2A03A;// 0x8CD0(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2AD4E6BA4009DE1A1227FB8E30442E77;// 0x8DF8(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4341CB2B41C8CE71F11FD99992273AEF;// 0x8E98(0x00D0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_D3C512D64B66B8F7AB92B79ECC95CAF9;// 0x8F68(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CB24DFE1476DD8F442B44BA8699E029A;// 0x9048(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_0C3B3D8545012BD32C4279A6D9EF3671;// 0x90E8(0x00D8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_A5A8AB0C4898B1E8A96865BEBB2553AF;// 0x91C0(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_8F9AC31F4FF4E91C8D66E0BD78A3FC31;// 0x9200(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_689193B84F6CFF0EF77188A24230B479;// 0x9240(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B95B570D4F9312E4873629B831816AE2;// 0x9368(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_24EBAC404BA78F0F89B2D9984A99993A;// 0x93A8(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_1A05EF9C4323A36A6F70749099B60F17;      // 0x9488(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_DD570C9A48A722A7D86C859447E22A7B;// 0x94F0(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7DEFD20F481DE3839AA90A9948CB5147;// 0x95C8(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_593AD5F2425093B67487BA8FC3A7AC3E;// 0x96A0(0x0048)
	struct FAnimNode_Root                              AnimGraphNode_Root_D9E9A0804062B964B460FCAE828CDEE7;      // 0x96E8(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_883BD8E84E3A5DD0F973009C9F00AEC7;// 0x9728(0x00D0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_772118D44AF91968CE4C5E837CAE85B6;// 0x97F8(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C01DB7D0479D7F3DA23686B4FE75640D;// 0x98D0(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_CD15FB8547F87928BC72FCBE264EC0A4;// 0x9970(0x00D8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_DBA850A445D03212EE356CAC86B53B38;// 0x9A48(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6CE1BBE646046042F96E8B84F823DEEB;// 0x9B20(0x0048)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_D5A6509A4806FF19E0156D90FDCBFCEE;// 0x9B68(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0A17C1DA4A8B5E81E90E4B9BD22CAFBC;// 0x9C48(0x00D8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_907CAF2441787C4407194683E3BE66E1;// 0x9D20(0x00D0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5B9EC6314ED6C699174490ADC375459D;// 0x9DF0(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_25D7F30E439A9A11E243F6B1A97AAFFB;// 0x9EC8(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_2EE077AB4F9A4BC7CA505DB1E8DFB448;      // 0x9F10(0x0068)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_06E6329D440877503CF21C8F2AE1467D;// 0x9F78(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_415D43324334437522FDE98B06DDB920;// 0xA048(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3ECA419E484D1918258784A0290031DD;// 0xA0E8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BF0F406E4B8303B312D26288426A2C8B;// 0xA188(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E5D1696E475643F6F07E528B9F940588;// 0xA1D0(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6B080E1C4B8EE2B40D8611BC4D42C351;// 0xA2A8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_88A192ED46B2D17FC8620FB886F528F5;// 0xA2F0(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9B276367400683E52151E191F3CD2506;// 0xA338(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3D21355E4CA427974861E7B0B6258A99;// 0xA408(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C5E373374C7F98C00D661CBD72F421AD;// 0xA450(0x00D0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_D3BC91A24AC3538BBB21ACA5E5B409B9;// 0xA520(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5F9EC77641287D565F90149167230F32;// 0xA5F8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D7A6A01246BB0A4580CC33B08824BBCE;// 0xA640(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_8D4A90BC466F6C6E3DE924AA10510DE9;// 0xA688(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8CDE97C3466618EAA4D152A3A13C845E;// 0xA760(0x00A0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E0DD9D9C45368C272291899EE13B5129;// 0xA800(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_179BB1374C83CDCD7D8F329EB7579EDA;// 0xA8D0(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_05468FED43B985D8DA3D58A539F586B5;// 0xA918(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2768F45C4A12AEAF6668C2AA75E78773;// 0xA9E8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_905223594A4AA8805B617A986985BBC0;// 0xAA30(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_106165644CE2C91A9C999D8BA2D8B4FE;// 0xAA70(0x0040)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7D2E1E724EEDCD4C5216B2980889E231;// 0xAAB0(0x00D0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_BEF54B0D4E594CA9A1E01BA182BFE79E;// 0xAB80(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4B994116459E8EB1645EE7A89829C5E4;// 0xAC58(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_74DEFCDD4C8888512D97B6AAA9C08898;// 0xACA0(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CC46D53641477E1712001A9E4C0FB215;// 0xACE8(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_310086B24504AE9DE35CD8AC18F57306;// 0xAE20(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A8B5106C4F8CB1D22E04A89230CACA04;// 0xAF58(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_52D8EEC847D1D3D75404848EAC38011B;// 0xB090(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5C0C47104251609F4C2730ABC4938AC2;// 0xB1C8(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8C597DD447DDD32A887064A7C852B639;// 0xB300(0x0138)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9D28C3AC4C4C8CDB2FE27DA107C6A684;// 0xB438(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_78060B44460D44F05D31149514FDF7D2;// 0xB510(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9874BEFC4ADDFFA4D2EA40B528C1F0C6;// 0xB558(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BCBA688D4D62F90BAEB4D8990B1CF404;// 0xB5A0(0x00D0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_C7D9C7BB42195BF8961B4CBEFFFF73BF;// 0xB670(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_03A293C94236A6728B7A05B341C19529;// 0xB748(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_BE85B6654C859BDAF1F5968EA561E571;// 0xB790(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_796594954B346A144CAE4693A65E6EB4;// 0xB7D8(0x00D0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_C11857154D2C55AB6B959EAA524B5870;      // 0xB8A8(0x0068)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_444FFF9D4F51778DF3725D8DC665DA5C;// 0xB910(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_07469EAA40FC50581F00B48D63CA5B59;// 0xB9E0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5E557F44414EF10CDEFED494B1DE5882;// 0xBA80(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_73F33FAF4B3174D2E40F4C81A37F6434;// 0xBB20(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_61954571447E75C9717EFF999E18D6FA;// 0xBBF8(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9F9561D046CDE2E9A295E5B364BFFEBF;// 0xBC40(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A3B27B4947CFCC2663E7C9B42C1E8ED0;// 0xBD18(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E43D53584477C9934C5094916CDCF3C4;// 0xBD60(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_ED9A0FE54C0EFC8A6A77138394A68C0D;// 0xBDA8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D94D91A247D538DE9E54738B26924E79;// 0xBDF0(0x0048)
	int                                                BlockPose;                                                // 0xBE38(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Speed;                                                    // 0xBE3C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AmuletSpeed;                                              // 0xBE40(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AmuletTimer;                                              // 0xBE44(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AmuletTime;                                               // 0xBE48(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CurrentSteeringFrame;                                     // 0xBE4C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              StomachPitch;                                             // 0xBE50(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     LookAtLocation;                                           // 0xBE54(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     SteeringWheelLookAtLocation;                              // 0xBE60(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<E_AnimationType>                       AnimationType;                                            // 0xBE6C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<E_Vehicles>                            VehicleState;                                             // 0xBE6D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FPSMode;                                                  // 0xBE6E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               SteeringRight;                                            // 0xBE6F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSteering;                                                // 0xBE70(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bInAir;                                                   // 0xBE71(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSprinting;                                               // 0xBE72(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Obstructed;                                               // 0xBE73(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               HammerEquiped;                                            // 0xBE74(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Repairing;                                                // 0xBE75(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               FullPose;                                                 // 0xBE76(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Blocking;                                                 // 0xBE77(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               UsingTeleport;                                            // 0xBE78(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               LookingAtWorldMap;                                        // 0xBE79(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               SpyGlassActive;                                           // 0xBE7A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Aiming;                                                   // 0xBE7B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               SwitchingWeapons;                                         // 0xBE7C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               Swimming;                                                 // 0xBE7D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               MakeHammerHitSound;                                       // 0xBE7E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsDead;                                                   // 0xBE7F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimingPlayRate;                                           // 0xBE80(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               CanRepair;                                                // 0xBE84(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               OnMovingBase;                                             // 0xBE85(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               WaterInShip;                                              // 0xBE86(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               OwnCharacterInspectMode;                                  // 0xBE87(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Character_AnimBP.Character_AnimBP_C");
		return ptr;
	}


	void PlayJumpLandSound(class UPhysicalMaterial* PhysicalSurface, const struct FVector& Location);
	void PlayJumpLaunchSound(class UPhysicalMaterial* PhysicalSurface, const struct FVector& Location);
	void PlayFootstepSound(class UPhysicalMaterial* SurfaceType, bool OwnFootsteps_, const struct FVector& WorldLocation);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Character_AnimBP_AnimGraphNode_BlendListByBool_5DC71AFD4E5103DD14DAACB28A288523();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Character_AnimBP_AnimGraphNode_BlendListByBool_A6D756E84352E62D3F1AEC8949DDA0B8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Character_AnimBP_AnimGraphNode_BlendListByBool_3D1BD5D04B40B429D99A19B3C9F16CC8();
