#pragma once

// Name: BlazingSails, Version: 1.481.81

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct ST_Customisation.ST_Customisation
// 0x0068
struct FST_Customisation
{
	struct FLinearColor                                TestColor_3_246B648147329FED4847AFAEE444FFD3;             // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Face_7_3598D7E34AF1707A7B5C74A16FC7D5F9;                  // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Hat_11_1599CC2E4AD16BED0B93018280B1C8D4;                  // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ShipSailColor_18_8C5372F643CD7BE1F1B61197EC01E98F;        // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BowHead_17_58B4123C48A58809B133739280548F05;              // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SailEmblem_63_0D946D2349D189E2A5F136B6890A6C5E;           // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ShipHullColorSet_29_832EDDC049A2563C7A8008B9F328C88C;     // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FlagColorSet_33_0C0AD4A1412C0B4D0F35D9A46EAFDF13;         // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RopeColor_36_6A44F6D84B65D7CB8884CC93513DF7D4;            // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FText                                       ShipName_39_C746DA084E10CD3FDF1C4C859B240401;             // 0x0030(0x0018) (Edit, BlueprintVisible)
	int                                                FlagEmblem_42_4FE4539A4210800631A88AB535B3BB36;           // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SkinColor_45_7C335432453D7FD00277EBACA53812E3;            // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Belt_50_928BE3324DE40FB0DA6128A34E22EA52;                 // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Pants_51_DC68605B446257D8DE24D3BDCCF67578;                // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Beard_54_2F225F984E71218B319D4D9EE189613E;                // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                LampColor_61_B512A5444920D0C2022AC484D81ACFC3;            // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SailEmblemBottom_71_83303D6248EF41170568E69ADD7CDC99;     // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                SailColorBottom_72_593CED7E48E2B8F53F6DC4AE505C8F5C;      // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
